var data = [{
        head: '房屋白蚁防治',
        content: '房屋白蚁防治您是否知道白蚁可能会使您的财产贬值超过25%？您是否知道白蚁还会给您的家居环境造成细菌滋生引起各种疾病？在蚁害区域内，对已竣工并交付使用的房屋，由于在建房时未采取过防蚁药物处理，或早或迟会发生白蚁的危害，如果不能及时解决白蚁问题，蚁害会造成高额的维修费用和损害身体健康，尤其是家中有老人和小孩，他们免疫力通常比较低，容易导致感冒发烧等不明症状。如果您房屋中在发现'
    }, {
        head: '树栖白蚁巢',
        content: '树芯巢： 一般建在树基或树根部，树芯巢多呈椭圆形，巢腔大小约是树木三分之二。被大水浸泡过的地方或被人为破坏时，树芯巢往往有往上迁移现象，在树杈处发现的蚁巢一般都是从树基或树根部迁移而来的。地下巢： 一般筑在墙角、门框、柱子或楼梯处的地下，深度一般在30厘米至一米左右，不会低于地下水位线。巢体形状、大小依环境而定。'
    }, {
        head: '白蚁能否分泌蚁酸？',
        content: '蚁酸（Formic acid）即甲酸（methane acid），化学式为HCOOH。因该物质最早是1670年由John Wray[1]通过蒸馏一种红蚂蚁（Formic rufa）得到的，故而得名。自然界的蚁酸广泛存在于植物及其果实、哺乳动物组织和昆虫毒液中。蚁酸可以作为脱钙剂用于工业制备各种药物、染料和化合物，也可以用于鞣制皮革。蚁酸也是空气和水的一种重'
    }, {
        head: '白蚁分类学',
        content: '白蚁科是等翅目中最大的科，约占全部种类的3/4。兵蚁、工蚁常有多态现象出现，但也有无兵蚁的组合类群。该科属土栖性白蚁，筑巢于地下或土垅中，属于最进化的高等白蚁。白蚁科分4亚科31属234种。兵蚁：前胸背板狭于头部，前缘翘起呈马鞍状，具囟，尾须1-2节，跗节3-4节。有翅成虫：左上颚仅具1-2枚缘齿，前翅鳞稍大于后翅鳞，前、后翅鳞分开，径脉退化或缺，后唇基大，隆起，囟明显。前胸背板狭于头部，尾须'
    },
    {
        head: '白蚁生态学',
        content: '白蚁是世界性的大害虫，危害面积占世界大陆面积的一半以上，对人类的生产、生活带来了很大的灾难，曾被国际昆虫生理生态研究中心（ICTPE）列为世界性五大害虫之一。一些地方把白蚁称为“无牙老虎”，可想其为害程度的严重性。在热带、亚热带地区，白蚁为害更为严重，人们的衣食住行无不遭受其害。由于它在非常隐蔽的情况下为害各种物品，一般不容易觉察它的为害，一旦发觉时，灾情'
    },
    {
        head: '如何检查家中有没有白蚁',
        content: '教大家早点知道家里有没白蚁，提前做好白蚁防范减轻损失，有蚁早治没早防处理，很多人对白蚁危害都不了解白蚁是如何来的，白蚁经过成虫之后在白蚁的纷飞季节，飞入家中，白蚁每年四到六月份就是白蚁纷飞季节，大家一定要关好门窗，如己有白蚁飞入家中的一定要打死他，还要做白蚁防治工作，很多人不认识白蚁的危害的，就这样不在乎，有更多的人见到白蚁还不认识，是农村人的其实很多人见过'
    },
    {
        head: '白蚁是世界性的害虫之一',
        content: '白蚁是世界性的害虫之一，在自然界的恶劣环境中，历经沧桑，却能安之若素地生存于至今。在其漫长的历史岁月中，它从未停止过对人类生产生活进行肆无忌惮地侵害，房屋建筑、家具衣物、仓储物资、水库堤坝、农林果木、通讯设备、车辆船舶、军需器械、图书档案等等，几乎涉及国计民生的各个领域，无所不噬、无所不损。而正因为白蚁能以隐蔽的生活方式，成千上万仍至数百万头'
    },
    {
        head: '白蚁防治新方法',
        content: '白蚁是社会性昆虫，发现白蚁为害时，其数目绝对是数万只到数十万只，没有丰富经经验的公司无法做出品质好的防治。白蚁防治法有两种，一种是传统做法，就是阻隔带做法，另一种是最新的蚁巢灭白蚁族群消灭法，分别介绍如下：　  　一、传统阻隔带做法：  　　一般住家受到白蚁危害，均不知道。而等到发现白蚁危害时，则已造成相当程度的损失。白蚁防治时必需找经'
    }, {
        head: '家庭白蚁防治小方法',
        content: '白蚁是多姓称的害虫，成虫的白蚁有些地方农村叫大水蚁又称白蚂蚁、它如老虎哪样凶猛所以也有人称他为白虎。      白蚁是世界五大害虫之一。它不仅吞噬家具、地板和门窗，还吃各种皮革，光缆甚至钢筋水泥。但是它主要食物是含纤维质的东西。他的纷飞季节在每年五六月正是成虫繁殖蚁纷飞期间，此时的纷飞孔会有大量兵蚁分散在纷飞孔护送成虫'
    },
];

function New(data, num) {
    this.index = num;
    this.data = data;
    this.init();
}
New.prototype = {
    bindDom: function() {
        var str = '';
        str += '<div class="knowledge-inner-page">';
        str += '<h3 class="text-center">' + this.data.head + '</h3>';
        str += '<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;' + this.data.content + '....<a href="detail.html?num=' + this.index + '">查看更多</a></p>';
        str += '<div class="konwledge-line"></div>';
        str += '</div>'
        var container = document.getElementById('knowledge-inner');
        container.innerHTML += str;
    },
    bindEvents: function() {},
    init: function() {
        this.bindDom();
        this.bindEvents();
    }
}
for (var i = 0; i < data.length; i++) {
    new New(data[i], i);
}